# FabricAreaOutSideOfHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricAreaFailures..::..FabricAreaOutSideOfHost Property
BuiltInFailures..::..FabricAreaFailures Class See Also
---
Fabric Area is sketched completely outside of its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricAreaOutSideOfHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricAreaOutSideOfHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricAreaOutSideOfHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricAreaFailures Class
Autodesk.Revit.DB Namespace